nasyid/app/controllers/nasyids_controller.rb

  def find
	@nasyids = Nasyid.find(:all,:conditions=>["Artis = ? OR Album = ?",params[:search_string], params[:search_string]])
---
SELECT * FROM "nasyids" WHERE (Sumber = 'Mohd Asri' OR Kategori = 'Mohd Asri')

  def index
    @nasyids = Nasyid.all
---
SELECT * FROM "nasyids"

  def show
    @nasyid = Nasyid.find(params[:id])
---
SELECT * FROM "nasyids" WHERE ("nasyids"."id" = 1)

  def edit
    @nasyid = Nasyid.find(params[:id])
---
SELECT * FROM "nasyids" WHERE ("nasyids"."id" = 1)

  def create
    @nasyid = Nasyid.new(params[:nasyid])

    respond_to do |format|
      if @nasyid.save
---
INSERT INTO "nasyids" ("Lirik", "updated_at", "Artis", "Album", "Sumber", "Judul", "Email", "Pengirim", "Kategori", "created_at") VALUES('', '2009-09-14 04:26:34', 'asdaf', 'asf', '', 'asdas', '', '', '', '2009-09-14 04:26:34')

  def update
    @nasyid = Nasyid.find(params[:id])

    respond_to do |format|
      if @nasyid.update_attributes(params[:nasyid])
---
SELECT * FROM "nasyids" WHERE ("nasyids"."id" = 2)
UPDATE "nasyids" SET "Sumber" = 'http://www.youtube.com/watch?v=lRURYNyX9Wk', "Lirik" = 'http://www.youtube.com/watch?v=lRURYNyX9Wk', "updated_at" = '2009-10-08 06:49:53' WHERE "id" = 9

  def destroy
    @nasyid = Nasyid.find(params[:id])
    @nasyid.destroy
---
SELECT * FROM "nasyids" WHERE ("nasyids"."id" = 1)
DELETE FROM "nasyids" WHERE "id" = 1